In [1]:
# Import liabraries

import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np

In [2]:
ds=pd.read_csv("D:\\Internship\\Machine learning\\raw_messy_dataset.xlsx.csv")
print(ds)

        Name      Age Gender              Email     Join_Date Salary  \
0      Alice      NaN    NaN  user0@example.com    2021-05-21    NaN
1        Bob       40      M  user1@example.com           NaN  50000
2    Charlie  unknown   Male  user2@example.com    2020/01/01  50000
3      David      NaN    NaN  user3@example.com    2021-05-21  70000
4        Eva       35  Other  user4@example.com  July 4, 2020  70000
..       ...      ...    ...                ...           ...    ...
100    Alice      NaN    NaN  user0@example.com    2021-05-21    NaN
101      Bob       40      M  user1@example.com           NaN  50000
102  Charlie  unknown   Male  user2@example.com    2020/01/01  50000
103    David      NaN    NaN  user3@example.com    2021-05-21  70000
104      Eva       35  Other  user4@example.com  July 4, 2020  70000

      Department
0          Admin
1    Engineering
2             HR
3          Admin
4    Engineering
..           ...
100        Admin
101  Engineering
102           HR
103        Admin
104  Engineering

[105 rows x 7 columns]

In [3]:
ds.to_excel("raw_messy_dataset.xlsx", index=False)
print(ds)

        Name      Age Gender              Email     Join_Date Salary  \
0      Alice      NaN    NaN  user0@example.com    2021-05-21    NaN
1        Bob       40      M  user1@example.com           NaN  50000
2    Charlie  unknown   Male  user2@example.com    2020/01/01  50000
3      David      NaN    NaN  user3@example.com    2021-05-21  70000
4        Eva       35  Other  user4@example.com  July 4, 2020  70000
..       ...      ...    ...                ...           ...    ...
100    Alice      NaN    NaN  user0@example.com    2021-05-21    NaN
101      Bob       40      M  user1@example.com           NaN  50000
102  Charlie  unknown   Male  user2@example.com    2020/01/01  50000
103    David      NaN    NaN  user3@example.com    2021-05-21  70000
104      Eva       35  Other  user4@example.com  July 4, 2020  70000

      Department
0          Admin
1    Engineering
2             HR
3          Admin
4    Engineering
..           ...
100        Admin
101  Engineering
102           HR
103        Admin
104  Engineering

[105 rows x 7 columns]

In [4]:
new_drop=ds.dropna()
print(new_drop.to_string)

<bound method DataFrame.to_string of         Name      Age  Gender               Email     Join_Date   Salary  \
2    Charlie  unknown    Male   user2@example.com    2020/01/01    50000
4        Eva       35   Other   user4@example.com  July 4, 2020    70000
6      Grace  unknown  Female   user6@example.com  July 4, 2020    80000
9       Jack       35    Male   user9@example.com    2020/01/01    80000
11       Bob       35       M  user11@example.com  July 4, 2020    50000
12   Charlie       35       M  user12@example.com    22-06-2022    80000
14       Eva       40    Male  user14@example.com  July 4, 2020    80000
18       Ivy       30    Male  user18@example.com    2021-05-21    50000
25     Frank       25       F  user25@example.com    22-06-2022    60000
29      Jack  unknown   Other  user29@example.com    2021-05-21    50000
30     Alice       40  Female  user30@example.com    2021-05-21    80000
31       Bob       25  Female  user31@example.com  July 4, 2020    50000
32   Charlie       25    Male  user32@example.com    2021-05-21    80000
33     David       35       M  user33@example.com    22-06-2022    50000
57    Hannah       40  Female  user57@example.com  July 4, 2020  unknown
59      Jack       40   Other  user59@example.com    2021-05-21    50000
64       Eva       30       M  user64@example.com  July 4, 2020    80000
67    Hannah       40   Other  user67@example.com  July 4, 2020    80000
70     Alice       40       M  user70@example.com    22-06-2022    50000
72   Charlie       40       F  user72@example.com  July 4, 2020    80000
78       Ivy       40   Other  user78@example.com    2021-05-21    70000
102  Charlie  unknown    Male   user2@example.com    2020/01/01    50000
104      Eva       35   Other   user4@example.com  July 4, 2020    70000

      Department
2             HR
4    Engineering
6    Engineering
9    Engineering
11         Sales
12         Sales
14            HR
18   Engineering
25         Sales
29         Sales
30         Admin
31         Admin
32     Marketing
33            HR
57     Marketing
59     Marketing
64     Marketing
67     Marketing
70     Marketing
72         Admin
78   Engineering
102           HR
104  Engineering  >

In [5]:
print(ds.duplicated())
ds.drop_duplicates(inplace=True)

0      False
1      False
2      False
3      False
4      False
       ...
100     True
101     True
102     True
103     True
104     True
Length: 105, dtype: bool

In [6]:
ds["Age"]=pd.to_numeric(ds["Age"],errors='coerce')
print(ds)

       Name   Age Gender              Email     Join_Date Salary   Department
0     Alice   NaN    NaN  user0@example.com    2021-05-21    NaN        Admin
1       Bob  40.0      M  user1@example.com           NaN  50000  Engineering
2   Charlie   NaN   Male  user2@example.com    2020/01/01  50000           HR
3     David   NaN    NaN  user3@example.com    2021-05-21  70000        Admin
4       Eva  35.0  Other  user4@example.com  July 4, 2020  70000  Engineering
..      ...   ...    ...                ...           ...    ...          ...
95    Frank   NaN   Male                NaN           NaN  50000          NaN
96    Grace  40.0   Male                NaN           NaN  70000        Sales
97   Hannah   NaN   Male                NaN    2020/01/01  60000          NaN
98      Ivy   NaN      F                NaN    2020/01/01  50000          NaN
99     Jack   NaN    NaN                NaN  July 4, 2020  60000        Admin

[100 rows x 7 columns]

In [7]:
y=ds["Age"].median()
ds["Age"].fillna(y)

0     35.0
1     40.0
2     35.0
3     35.0
4     35.0
      ...
95    35.0
96    40.0
97    35.0
98    35.0
99    35.0
Name: Age, Length: 100, dtype: float64

In [8]:
ds["Gender"].unique()
print(ds)

       Name   Age Gender              Email     Join_Date Salary   Department
0     Alice   NaN    NaN  user0@example.com    2021-05-21    NaN        Admin
1       Bob  40.0      M  user1@example.com           NaN  50000  Engineering
2   Charlie   NaN   Male  user2@example.com    2020/01/01  50000           HR
3     David   NaN    NaN  user3@example.com    2021-05-21  70000        Admin
4       Eva  35.0  Other  user4@example.com  July 4, 2020  70000  Engineering
..      ...   ...    ...                ...           ...    ...          ...
95    Frank   NaN   Male                NaN           NaN  50000          NaN
96    Grace  40.0   Male                NaN           NaN  70000        Sales
97   Hannah   NaN   Male                NaN    2020/01/01  60000          NaN
98      Ivy   NaN      F                NaN    2020/01/01  50000          NaN
99     Jack   NaN    NaN                NaN  July 4, 2020  60000        Admin

[100 rows x 7 columns]

In [9]:
#missing value fill in email block
ds["Email"].fillna("-")

0     user0@example.com
1     user1@example.com
2     user2@example.com
3     user3@example.com
4     user4@example.com
            ...
95                    -
96                    -
97                    -
98                    -
99                    -
Name: Email, Length: 100, dtype: object

In [10]:
#handling date column
ds["Join Date"]=pd.to_datetime(ds["Join_Date"],errors='coerce')
ds.info

<bound method DataFrame.info of        Name   Age Gender              Email     Join_Date Salary   Department  \
0     Alice   NaN    NaN  user0@example.com    2021-05-21    NaN        Admin
1       Bob  40.0      M  user1@example.com           NaN  50000  Engineering
2   Charlie   NaN   Male  user2@example.com    2020/01/01  50000           HR
3     David   NaN    NaN  user3@example.com    2021-05-21  70000        Admin
4       Eva  35.0  Other  user4@example.com  July 4, 2020  70000  Engineering
..      ...   ...    ...                ...           ...    ...          ...
95    Frank   NaN   Male                NaN           NaN  50000          NaN
96    Grace  40.0   Male                NaN           NaN  70000        Sales
97   Hannah   NaN   Male                NaN    2020/01/01  60000          NaN
98      Ivy   NaN      F                NaN    2020/01/01  50000          NaN
99     Jack   NaN    NaN                NaN  July 4, 2020  60000        Admin

    Join Date
0  2021-05-21
1         NaT
2         NaT
3  2021-05-21
4         NaT
..        ...
95        NaT
96        NaT
97        NaT
98        NaT
99        NaT

[100 rows x 8 columns]>

In [11]:
#handling salary column coverting into numeric
ds["Salary"]=pd.to_numeric(ds["Salary"],errors='coerce')
print(ds)
ds.info()

       Name   Age Gender              Email     Join_Date   Salary  \
0     Alice   NaN    NaN  user0@example.com    2021-05-21      NaN
1       Bob  40.0      M  user1@example.com           NaN  50000.0
2   Charlie   NaN   Male  user2@example.com    2020/01/01  50000.0
3     David   NaN    NaN  user3@example.com    2021-05-21  70000.0
4       Eva  35.0  Other  user4@example.com  July 4, 2020  70000.0
..      ...   ...    ...                ...           ...      ...
95    Frank   NaN   Male                NaN           NaN  50000.0
96    Grace  40.0   Male                NaN           NaN  70000.0
97   Hannah   NaN   Male                NaN    2020/01/01  60000.0
98      Ivy   NaN      F                NaN    2020/01/01  50000.0
99     Jack   NaN    NaN                NaN  July 4, 2020  60000.0

     Department  Join Date
0         Admin 2021-05-21
1   Engineering        NaT
2            HR        NaT
3         Admin 2021-05-21
4   Engineering        NaT
..          ...        ...
95          NaN        NaT
96        Sales        NaT
97          NaN        NaT
98          NaN        NaT
99        Admin        NaT

[100 rows x 8 columns]
<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         57 non-null     float64
 2   Gender      86 non-null     object
 3   Email       90 non-null     object
 4   Join_Date   66 non-null     object
 5   Salary      60 non-null     float64
 6   Department  84 non-null     object
 7   Join Date   24 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(5)
memory usage: 7.0+ KB

In [12]:
#department sorting to find unique
ds["Department"].unique()

array(['Admin', 'Engineering', 'HR', 'Sales', nan, 'Marketing'],
      dtype=object)

In [13]:
y=ds["Department"].mode()[0]
y

'Engineering'

In [14]:
ds["Department"].fillna(y,inplace=True)

C:\Users\Sri\AppData\Local\Temp\ipykernel_7228\1213118009.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Department"].fillna(y,inplace=True)

In [15]:
ds["Department"].unique()

array(['Admin', 'Engineering', 'HR', 'Sales', 'Marketing'], dtype=object)

In [24]:
ds["Gender"]=ds["Gender"].replace({"M":"Male","F":"Female"," ":"NaN"})
print(ds["Gender"])

0        NaN
1       Male
2       Male
3        NaN
4      Other
       ...
95      Male
96      Male
97      Male
98    Female
99       NaN
Name: Gender, Length: 100, dtype: object